* BoTifiCator

Project for monitoring some selected bitcoin indicators

** Database

#+begin_src bash
docker kill timescaledb-container
#+end_src

#+RESULTS:
: timescaledb-container

#+begin_src bash
docker volume rm timescaledb_data
#+end_src

#+RESULTS:
: timescaledb_data

#+begin_src bash
docker run --rm --name timescaledb-container \
  -e POSTGRES_PASSWORD=postgres \
  -v timescaledb_data:/var/lib/postgresql/data \
  -v ./sql:/docker-entrypoint-initdb.d \
  -p 5432:5432 \
  -d timescale/timescaledb:latest-pg17

  #-c timescaledb.enable_cagg_window_functions=on # TODO: explore this feature
#+end_src

#+RESULTS:
: 1e5d4e0b16ae7a17f0426c33e1bbbb1e80b9b176528f027456683a599428605c

#+headers: :engine postgresql :cmdline "postgres://postgres:postgres@localhost:5432/postgres"
#+begin_src sql
SHOW timescaledb.enable_cagg_window_functions;
#+end_src

#+RESULTS:
| timescaledb.enable_cagg_window_functions |
|------------------------------------------|
| on                                       |

*** Tables

**** Test Data

#+headers: :engine postgresql :cmdline "postgres://postgres:postgres@localhost:5432/postgres"
#+begin_src sql
SELECT *
FROM btc_ohlc_5min
ORDER BY time DESC
LIMIT 3;
#+end_src

#+RESULTS:
| time                   |        open |        high |         low |       close |                  volume |
|------------------------+-------------+-------------+-------------+-------------+-------------------------|
| 2026-03-10 20:50:00+00 | 70328.00000 | 70338.00000 | 70256.00000 | 70260.00000 | 11.30105345000000000000 |
| 2026-03-10 20:45:00+00 | 70311.00000 | 70312.00000 | 70248.00000 | 70306.00000 | 14.75440043000000000000 |
| 2026-03-10 20:40:00+00 | 70301.00000 | 70355.00000 | 70234.00000 | 70306.00000 | 43.46711841000000000000 |

**** Daily


#+headers: :engine postgresql :cmdline "postgres://postgres:postgres@localhost:5432/postgres"
#+begin_src sql
DROP MATERIALIZED VIEW btc_avg_1day CASCADE;
#+end_src

#+RESULTS:
| DROP MATERIALIZED VIEW |
|------------------------|


#+headers: :engine postgresql :cmdline "postgres://postgres:postgres@localhost:5432/postgres"
#+begin_src sql
CREATE MATERIALIZED VIEW IF NOT EXISTS
    btc_avg_1day
WITH (timescaledb.continuous) AS
SELECT
    time_bucket('1 day', time) AS day,
    avg(open) as average
FROM
    btc_ohlc_5min
GROUP BY
    day
;
ALTER MATERIALIZED VIEW
    btc_avg_1day
SET
    (timescaledb.materialized_only = false)
;
#+end_src

#+RESULTS:
| CREATE MATERIALIZED VIEW |
|--------------------------|
| ALTER MATERIALIZED VIEW  |


#+headers: :engine postgresql :cmdline "postgres://postgres:postgres@localhost:5432/postgres"
#+begin_src sql
SELECT *
FROM btc_avg_1day
ORDER BY day DESC
LIMIT 3;
#+end_src

#+RESULTS:
| day                    |       average_1day |
|------------------------+--------------------|
| 2026-03-11 00:00:00+00 | 70000.443983402490 |
| 2026-03-10 00:00:00+00 | 70241.645833333333 |
| 2026-03-09 00:00:00+00 | 68002.708333333333 |



**** Weekly

#+headers: :engine postgresql :cmdline "postgres://postgres:postgres@localhost:5432/postgres"
#+begin_src sql
DROP MATERIALIZED VIEW btc_avg_1week CASCADE;
#+end_src

#+RESULTS:
| DROP MATERIALIZED VIEW |
|------------------------|


#+headers: :engine postgresql :cmdline "postgres://postgres:postgres@localhost:5432/postgres"
#+begin_src sql
CREATE MATERIALIZED VIEW IF NOT EXISTS
    btc_avg_1week
WITH (timescaledb.continuous) AS
SELECT
    day,
    time_bucket('1 week', day) AS week,
    avg(average) as average
FROM
    btc_avg_1day
GROUP BY
    day,
    week
;
ALTER MATERIALIZED VIEW
    btc_avg_1week
SET
    (timescaledb.materialized_only = false)
;
#+end_src

#+RESULTS:
| CREATE MATERIALIZED VIEW |
|--------------------------|
| ALTER MATERIALIZED VIEW  |

#+headers: :engine postgresql :cmdline "postgres://postgres:postgres@localhost:5432/postgres"
#+begin_src sql
SELECT *
FROM btc_avg_1week
ORDER BY week DESC
LIMIT 3;
#+end_src

#+RESULTS:
| day                    | week                   |      average_1week |
|------------------------+------------------------+--------------------|
| 2026-03-09 00:00:00+00 | 2026-03-09 00:00:00+00 | 68002.708333333333 |
| 2026-03-10 00:00:00+00 | 2026-03-09 00:00:00+00 | 70241.645833333333 |
| 2026-03-11 00:00:00+00 | 2026-03-09 00:00:00+00 | 70000.443983402490 |

***** Moving Averages

#+headers: :engine postgresql :cmdline "postgres://postgres:postgres@localhost:5432/postgres"
#+begin_src sql
DROP VIEW btc_moving_avg_1week CASCADE;
#+end_src

#+RESULTS:
| DROP VIEW |
|-----------|

#+headers: :engine postgresql :cmdline "postgres://postgres:postgres@localhost:5432/postgres"
#+begin_src sql
CREATE OR REPLACE VIEW
    btc_moving_avg_1week
AS SELECT
    day,
    time_bucket('1 week', week) as week,
    avg(average) OVER(ORDER BY week ROWS BETWEEN 199 PRECEDING AND CURRENT ROW) as moving_average_200,
    avg(average) OVER(ORDER BY week ROWS BETWEEN  99 PRECEDING AND CURRENT ROW) as moving_average_100
FROM
    btc_avg_1week
ORDER BY
    day,
    week
DESC
;
#+end_src

#+RESULTS:
| CREATE VIEW |
|-------------|

#+headers: :engine postgresql :cmdline "postgres://postgres:postgres@localhost:5432/postgres"
#+begin_src sql
SELECT *
FROM btc_moving_avg_1week
ORDER BY week DESC
LIMIT 3;
#+end_src

#+RESULTS:
| day                    | week                   | moving_average_1week_200 | moving_average_1week_100 |
|------------------------+------------------------+--------------------------+--------------------------|
| 2026-03-09 00:00:00+00 | 2026-03-09 00:00:00+00 |       95321.460000000000 |       82084.514513888889 |
| 2026-03-10 00:00:00+00 | 2026-03-09 00:00:00+00 |       95100.765607638889 |       81875.047048611111 |
| 2026-03-11 00:00:00+00 | 2026-03-09 00:00:00+00 |       94873.429615750346 |       81713.814162056247 |

#+headers: :engine postgresql :cmdline "postgres://postgres:postgres@localhost:5432/postgres"
#+begin_src sql
SELECT COUNT(week)
FROM btc_avg_1week;
#+end_src

#+RESULTS:
| count |
|-------|
|   324 |

**** Read

#+headers: :engine postgresql :cmdline "postgres://postgres:postgres@localhost:5432/postgres"
#+begin_src sql
SELECT
    btc_avg_1day.day,
    btc_avg_1week.week,
    btc_avg_1day.daily_average,
    btc_avg_1week.weekly_average
    --btc_moving_avg_1week.moving_average_200,
    --btc_moving_avg_1week.moving_average_100
FROM
    btc_avg_1day
JOIN
    btc_avg_1week
ON
    btc_avg_1day.day = btc_avg_1week.day
--JOIN
--    btc_moving_avg_1week
--ON
--    btc_avg_1day.day = btc_moving_avg_1week.day
ORDER BY
    btc_avg_1day.day
DESC
LIMIT
    3
;
#+end_src

#+RESULTS:
| day                    | week                   |         daily_average |        weekly_average |
|------------------------+------------------------+-----------------------+-----------------------|
| 2020-03-03 00:00:00+00 | 2020-03-02 00:00:00+00 | 8833.4497222222222222 | 8833.4497222222222222 |
| 2020-03-02 00:00:00+00 | 2020-03-02 00:00:00+00 | 8746.5821527777777778 | 8746.5821527777777778 |
| 2020-03-01 00:00:00+00 | 2020-02-24 00:00:00+00 | 8556.9421180555555556 | 8556.9421180555555556 |

** Data

bitstamp.com HTTP API

*** Rate Limits

400 per second

#+begin_src julia
1000 / 400
#+end_src

#+RESULTS:
: 2.5

10 000 per 10 minutes

#+begin_src julia
1000 * 60 * 10 / 10000
#+end_src

#+RESULTS:
: 60.0

=> wait 100 ms per request just to be safe
